DRL_py/env/sample_0/trajectory_1/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

# dummy file for post-processing with paraview
touch post.foam

# mesh creation
runApplication blockMesh
runApplication snappyHexMesh -overwrite
runApplication extrudeMesh

# set inlet velocity
cp -r 0.org 0
runApplication setExprBoundaryFields

# run case
runApplication $(getApplication)

#------------------------------------------------------------------------------
