DRL_py/env/sample_0/trajectory_1/Allrun.singularity
#!/bin/bash
cd "${0%/*}" || exit     # run from this directory
. ../../../functions        # singularity run functions
#------------------------------------------------------------------------------

# dummy file for post-processing with paraview
touch post.foam

# mesh creation
singularityRun blockMesh
singularityRun snappyHexMesh -overwrite
singularityRun extrudeMesh

# set inlet velocity
cp -r 0.org 0
singularityRun setExprBoundaryFields

# decompose and run case
singularityRun pimpleFoam 

#------------------------------------------------------------------------------
